clear
LoadData
% 初始化
q_EKF1=[]; %保存过程中的估计值，方便画图
q_EKF2=[]; %stage2的估计值
tes=[];
%过程误差协方差矩阵
Q=10^-6*[1 0 0 0;
         0 1 0 0;
         0 0 1 0;
         0 0 0 1];
%状态误差协方差矩阵
P_0=0.001*[0.125 0.03 0.03 0.03;
     0.03 0.125 0.03 0.03;
     0.03 0.03 0.03 0.125;
     0.03 0.03 0.03 0.125];
%  P_1=[0.001 0.0002 0.0002 0.0002;
%      0.0002 0.001 0.0002 0.0002;
%      0.0002 0.0002 0.001 0.0002;
%      0.0002 0.0002 0.0002 0.001];
%测量误差协方差矩阵
 R_1=1*[0.05 0  0;
     0 0.05 0;
     0 0 0.05];
R_2=0.1*[1 0 0;
     0 1 0;
     0 0 1];
 LoadData;
 q_=Quat(1,:)'; % 初始状态
 q_EKF1=[q_EKF1 q_];
 q_EKF2=[q_EKF2 q_];
 q_MEA=[];
 P_=P_0;
 T=[];
% 假设实时入读，从csv中读入状态后，循环输入
for i=1:length(data)
%% 预测步骤
%1. 读陀螺仪gyro数据，得到角速度w_x,w_y,w_z;
w_x=Gyro_w(i,1);
w_y=Gyro_w(i,2);
w_z=Gyro_w(i,3);

%2. 计算离散时间状态转移矩阵A_k=I+(1/2)Omega*T
Omega=[0 -w_x -w_y -w_z;
       w_x 0 w_z -w_y;
       w_y -w_z 0 w_x;
       w_z w_y -w_x 0];
delta_T=0.02;
A=eye(4)+0.5.*Omega.*delta_T;

%3. 计算先验系统状态估计q_k=Ak*q_k-1
q_=q_/norm(q_);
q=A*q_;

%注意！一定要做归一化处理！！！
q_norm=(q(1)^2+q(2)^2+q(3)^2+q(4)^2)^0.5;
q=q/q_norm;

%4. 计算系统噪声协方差矩阵P-_k=A_k*P_k-1*A_kT+Q_k
P=A*P_*A'+Q;


%% 更新步骤  Stage1：陀螺仪与加速度计的EKF
%1.  计算雅可比矩阵
H_1=[-2*q(3) 2*q(4) -2*q(1) 2*q(2);
      2*q(2) 2*q(1) 2*q(4) 2*q(3);
      2*q(1) -2*q(2) -2*q(3) 2*q(4)];

%2. 计算卡尔曼增益
K_1=P*H_1'/(H_1*P*H_1'+R_1);

%3. 读加速度数据
a_x=Acc(i,1);
a_y=Acc(i,2);
a_z=Acc(i,3);
z_1=[a_x,a_y,a_z]';
z_1=z_1/norm(z_1);
%z_1=[0 0 9.78]';

%4. 计算非线性函数后的结果
h_1=[2*q(2)*q(4)-2*q(1)*q(3) 2*q(1)*q(2)+2*q(3)*q(4) q(1)^2-q(2)^2-q(3)^2+q(4)^2]';
h_1=h_1/norm(h_1);


%5. 计算修正因子q_cor
t=z_1-h_1;
T=[T t];
q_cor=K_1*t;
%q_cor=q_cor/norm(q_cor);
q_cor(4)=0;


%6. 计算更新后的后验状态估计
q_hat=q+q_cor;
q_EKF1=[q_EKF1 q_hat];

%7. 计算更新后的后验误差协方差矩阵
P_1=(eye(length(K_1*H_1))-K_1*H_1)*P_;

%8. 重新赋值，进入下一步预测
% q_=q_hat;
% P_=P_1;

%% Stage2 
%1.  计算雅可比矩阵2
H_2=[2*q(4) 2*q(3) 2*q(2) 2*q(1);
     2*q(1) -2*q(2) -2*q(3) -2*q(4);
     -2*q(2) -2*q(1) 2*q(4) 2*q(3)];

%2.  计算卡尔曼增益2
K_2=P*H_2'/(H_2*P*H_2'+R_2);

%3.  磁力计数据
magx=Mag(i,1);
magy=Mag(i,2);
magz=Mag(i,3);
z_2=[magx magy magz]';
z_2=z_2/norm(z_2);

%4.  非线性函数h2
h_2=[2*q(2)*q(3)+2*q(1)*q(4);
     q(1)^2-q(2)^2-q(3)^2-q(4)^2;
     2*q(3)*q(4)-2*q(1)*q(2)];
 h_2=h_2/norm(h_2);
 
%5.  修正因子2
q_cor_2=K_2*(z_2-h_2);
%q_cor_2=q_cor_2/norm(q_cor_2);
q_cor_2(2)=0;
q_cor_2(3)=0;
tes=[tes q_cor_2];
%6. 
q_cor_2=0;
q_hat2=q_hat+q_cor_2;
q_EKF2=[q_EKF2 q_hat2];

%7. 计算更新后的后验误差协方差矩阵
P_2=(eye(length(K_2*H_2))-K_2*H_2)*P_1;

q_=q_hat2;
P_=P_2;

end




